# GetPointsForPlacement Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarCoupler..::..GetPointsForPlacement Method
RebarCoupler Class See Also
---
gets the point (or points in case of rebar set) where the coupler is placed
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public IList<XYZ> GetPointsForPlacement()
```

Visual Basic
---
```text
Public Function GetPointsForPlacement As IList(Of XYZ)
```

Visual C++
---
```text
public:
IList<XYZ^>^ GetPointsForPlacement()
```

# See Also
RebarCoupler Class
Autodesk.Revit.DB.Structure Namespace